# Assignment 9

## Try to submit as an HTML file

<font size = "5">
Print your Emory ID below

In [46]:
# Write your answer here:
print(2634998)

2634998

<font size = "5">

Import the `pandas`, `psycopg2`, and `sqlalchemy` libraries

From the `sqlalchemy` library, import the `create_engine` and `text` functions

In [47]:
# Write your answer here:
import pandas as pd 
import psycopg2
from sqlalchemy import create_engine, text

<font size = "5">

Establish a connection to the SQL server and database `postgres` from Python 
Use `create_engine()` and name `engine.connect()` as `connection` as in the class example

In [48]:
# Write your own code
engine = create_engine('postgresql+psycopg2://postgres:asdf1234@localhost:5432/postgres')
conn = engine.connect()

<font size = "5">

In this homework, the queries should be done in Python using the `pandas` library.

- For (a)-(e) read the section on "Escape Characters" carefully and how to write strings in multiple lines
- Ensure for each exercise you are using the specific Python commands (ie, `pd.read_sql`)


<font size = "5">

(a) Upload dataset to SQL


- First, read the file `homework10_table.csv` in the `data_raw` folder (use the same name for the dataframe)
- Upload the file to your local SQL server using the `to_sql` command

In [49]:
# Write your own code
homework10_table = pd.read_csv("data_raw/homework10_table.csv")
homework10_table.to_sql('homework10_table', conn, if_exists='replace', index=False)

10


<font size = "5">

For questions (b)-(e) we will be working with the table ` homework9_table ` in the SQL server 

You are required to use the `read_sql` command for all the following questions


<font size = "5">

(b) Subset and sort


- Use `WHERE` to get a subset of `homework10_table` to subset drivers whose nationality is British
- Chain this with ```ORDER BY driver_name ASC``` to sort in ascending order

Hints:
- Remember to define strings over multiple lines
- We can include single quotations in the `WHERE` command without any additional escape characters
- Or you can just use triple quotes for the entire string

In [50]:
# Write your own code
pd.read_sql("""
    SELECT * 
    FROM homework10_table
    WHERE nationality = 'British'
    ORDER BY driver_name ASC;
""", conn)

   Unnamed: 0  driver_id     driver_name nationality  lap_times
0           5          6    Henry Louvre     British         32
1           4          5  Lewis Hamilton     British        103
2           0          1    Simon Cowell     British         74

<font size = "5">

(c) Groupby + Aggregate + Sort

- Obtain the average of `lap_times` by `driverId` using `GROUP BY`
- Use `ORDER BY` to sort by the average of `lap_times`
- Make sure to seperate pieces of your logic over seperate lines

In [51]:
# Write your own code
pd.read_sql("""
    SELECT driver_id, 
           AVG(lap_times) AS avg_lap_time
    FROM homework10_table
    GROUP BY driver_id
    ORDER BY avg_lap_time;
""", conn)

   driver_id  avg_lap_time
0          9          11.0
1         10          24.0
2          2          26.0
3          6          32.0
4          8          53.0
5          1          74.0
6          3          82.0
7          4          87.0
8          7          91.0
9          5         103.0

<font size = "5">

(d) Groupby + Aggregate + Sort

- Obtain the sum of `lap_times` by nationality using `GROUP BY`
- Use `HAVING` to filter nationalities with a sum of lap times strictly higher than 150
- Make sure to seperate pieces of your logic over seperate lines



HINT: See the end of lecture 16 for details <br>
HINT: Use `HAVING SUM(lap_times)` rather than an alias for the code to work correctly

In [54]:
# Write your own code
pd.read_sql("""
    SELECT nationality, 
       SUM(lap_times) AS total_lap_time
FROM homework10_table
GROUP BY nationality
HAVING SUM(lap_times) > 150
ORDER BY total_lap_time;
""", conn)

  nationality  total_lap_time
0     British           209.0
1      German           261.0

<font size = "5">

(e) Groupby and multiple aggregations

- In this exercise, we will obtain multiple statistics about each nationality and their lap times.
- Obtain the sum, min, max, and range of each nationality's lap times using `GROUP BY`
- Make sure to separate pieces of your code

HINT: There is no built in range function in SQL, however you can use the <br>
`MAX` and `MIN` functions to build your own function, like this:

` MAX(lap_times)-MIN(lap_times) AS range_laptimes`

In [55]:
# Write your own code
pd.read_sql("""
SELECT nationality, 
       SUM(lap_times) AS total_lap_time,
       MIN(lap_times) AS min_lap_time,
       MAX(lap_times) AS max_lap_time,
       MAX(lap_times) - MIN(lap_times) AS range_lap_times
FROM homework10_table
GROUP BY nationality;          
""", conn)

  nationality  total_lap_time  min_lap_time  max_lap_time  range_lap_times
0      German           261.0            11            91               80
1     Spanish           113.0            26            87               61
2     British           209.0            32           103               71